from telegram import ReplyKeyboardMarkup

from telegram.ext import CommandHandler, MessageHandler, filters
import logging
# Основной обработчик для меню с подразделениями
async def ask_napr_question(update, context):
    context.user_data.clear()  # Очистим данные пользователя
    keyboard = [
        ["Направление 09.03.01 — Информатика и вычислительная техника"],
        ["Направление 09.03.02 — Информационные системы и технологии"],
        ["Направление 09.03.03 — Прикладная информатика", "Направление 09.03.04 — Программная инженерия"],
        ["⬅️ Меню"]
    ]
    reply_markup = ReplyKeyboardMarkup(keyboard, one_time_keyboard=False, resize_keyboard=True)
    await update.message.reply_text("Какая информация тебя интересует?", reply_markup=reply_markup)

napr_buttons = [
        "Направление 09.03.01 — Информатика и вычислительная техника",
        "Направление 09.03.02 — Информационные системы и технологии",
        "Направление 09.03.03 — Прикладная информатика",
        "Направление 09.03.04 — Программная инженерия",
    ]

async def send_napr_schedule(update, context):
        department = update.message.text  # Извлекаем текст выбранного отдела

        # Пример отправки расписания для каждого отдела (вам нужно будет заменить эти строки на актуальное расписание)
        if department =="Направление 09.03.01 — Информатика и вычислительная техника":
            schedule = (
                "<b>Направление 09.03.01 — Информатика и вычислительная техника</b>\n\n"
                "<b>Кафедра вычислительных систем и сетей</b>\n"
                "<b>Программа:</b> Компьютерные технологии, системы и сети\n\n"
                "<b>Форма обучения:</b> очная, 4 года\n"
                "<b>Бюджетные места:</b> 84\n"
                "<b>Контрактные места:</b> 10\n"
                "<b>Целевая квота:</b> 13 мест\n"
                "<b>Особая квота:</b> 9 мест\n"
                "<b>Отдельная квота:</b> 9 мест\n\n"
                "<b>Проходной балл в 2024 году:</b> 244\n\n"

                "<b>Цель программы —</b> подготовка высококвалифицированных специалистов, способных решать сложные задачи в сфере информационных технологий.\n\n"

                "В процессе обучения студенты изучают:\n"
                "🔹Основы информатики и программирования\n"
                "🔹Сетевые и мультимедиа технологии\n"
                "🔹Микроэлектронику\n"
                "🔹Практические навыки работы с современным программным обеспечением и оборудованием\n\n"

                "<b>Карьерные перспективы выпускников:</b>\n"
                "▪️Проектирование, разработка, внедрение и эксплуатация средств вычислительной техники\n"
                "▪️Работа с информационными системами и управление их жизненным циклом\n"
                "▪️Проектирование и моделирование объектов визуальной информации\n"
                "▪️Другие сферы IT-индустрии\n\n"

                '<b>Подробнее:</b>\n'
                '<a href="https://priem.guap.ru/bach/calc?filter=dep_4#bach">Приёмная комиссия ГУАП</a>\n'
                '<a href="https://new.guap.ru/i04/k44">Страница кафедры</a>\n'
                "\n"
            )

        elif department == "Направление 09.03.02 — Информационные системы и технологии":
            schedule = (
                "<b>09.03.02 — Информационные системы и технологии</b>\n\n"

                "<b>Программа:</b> Информационные системы и технологии в бизнесе\n"
                "<b>Выпускающая кафедра:</b> информационных систем и технологий\n\n"
                "<b>Форма обучения:</b> очная, 4 года\n"
                "<b>Бюджетные места:</b> 85\n"
                "<b>Контрактные места:</b> 20\n"
                "<b>Контракт (иностранные граждане):</b> 5 мест\n"
                "<b>Целевая квота:</b> 13 мест\n"
                "<b>Особая квота:</b> 9 мест\n"
                "<b>Отдельная квота:</b> 9 мест\n\n"
                "<b>Проходной балл в 2024 году:</b> 222\n\n"

                "<b>Цель программы —</b> подготовка высококвалифицированных специалистов в области разработки, внедрения "
                "и применения информационных систем и технологий для решения задач в сфере дизайна.\n\n"

                "<b>Основные изучаемые направления:</b>\n"
                "🔹 Компьютерная графика и обработка изображений\n"
                "🔹 Моделирование 3D-сцен\n"
                "🔹 Графический и UI/UX дизайн\n"
                "🔹 Веб-дизайн\n"
                "🔹 Программирование на Python, C++, C#, Java, JavaScript, Kotlin\n"
                "🔹 Моделирование информационных систем\n"
                "🔹 Проектирование баз данных\n"
                "🔹 Использование методов искусственного интеллекта\n"
                "🔹 Визуализация и анализ больших данных\n"
                "🔹 Техническая документация в сфере ИТ\n\n"

                "<b>Программа:</b> Информационные технологии в медиаиндустрии\n"
                "<b>Выпускающая кафедра:</b> информационных систем и технологий\n\n"
                "<b>Форма обучения:</b> очная, 4 года\n"
                "<b>Бюджетные места:</b> 85\n"
                "<b>Контрактные места:</b> 20\n"
                "<b>Контракт (иностранные граждане):</b> 5 мест\n"
                "<b>Целевая квота:</b> 13 мест\n"
                "<b>Особая квота:</b> 9 мест\n"
                "<b>Отдельная квота:</b> 9 мест\n\n"
                "<b>Проходной балл в 2024 году:</b> 222\n\n"

                "<b>Цель программы —</b> подготовка специалистов в сфере разработки, внедрения и сопровождения "
                "информационных технологий в области медиаиндустрии.\n\n"

                "<b>Основные изучаемые направления:</b>\n"
                "🔹 Разработка Web-приложений и сервисов\n"
                "🔹 Графический дизайн и 3D-моделирование\n"
                "🔹 Программирование\n"
                "🔹 Использование методов искусственного интеллекта\n"
                "🔹 Визуализация и анализ больших данных\n"
                "🔹 Основы разработки игр\n"
                "🔹 Теория передачи и защиты информации\n\n"

                "<b>Программа:</b> Информационные системы и технологии\n"
                "<b>Выпускающая кафедра:</b> информационных систем и технологий\n\n"
                "<b>Форма обучения:</b> очная, 4 года\n"
                "<b>Бюджетные места:</b> 85\n"
                "<b>Контрактные места:</b> 20\n"
                "<b>Контракт (иностранные граждане):</b> 5 мест\n"
                "<b>Целевая квота:</b> 13 мест\n"
                "<b>Особая квота:</b> 9 мест\n"
                "<b>Отдельная квота:</b> 9 мест\n\n"
                "<b>Проходной балл в 2024 году:</b> 222\n\n"

                "<b>Цель программы —</b> подготовка специалистов в сфере разработки, внедрения и сопровождения "
                "информационных систем и технологий в бизнес-процессы.\n\n"

                "<b>Основные изучаемые направления:</b>\n"
                "🔹 Бизнес-аналитика и менеджмент\n"
                "🔹 Интернет-маркетинг и рекламная деятельность\n"
                "🔹 Администрирование в информационных системах\n"
                "🔹 Интернет вещей\n"
                "🔹 Проектирование информационных систем\n"
                "🔹 Веб- и мультимедийные технологии\n"
                "🔹 Программирование\n"
                "🔹 Использование методов искусственного интеллекта\n"
                "🔹 Визуализация и анализ больших данных\n"
                "🔹 Сбор, обработка и хранение информации\n\n"

                '<b>Подробнее:</b>\n'
                '<a href="https://priem.guap.ru/bach/calc?filter=dep_4#bach">Приёмная комиссия ГУАП</a>\n'
                '<a href="https://new.guap.ru/i04/k42">Страница кафедры</a>\n'
                "\n"
            )

        elif department == "Направление 09.03.03 — Прикладная информатика":
            schedule = (
                "<b>Направление 09.03.03 — Прикладная информатика</b>\n\n"

                "<b>Программа:</b> Прикладная информатика в информационной сфере\n\n"

                "<b>Форма обучения:</b> очная, 4 года\n"
                "<b>Бюджетные места:</b> 90\n"
                "<b>Контрактные места:</b> 10\n"
                "<b>Контракт (иностранные граждане):</b> 2 места\n"
                "<b>Целевая квота:</b> 12 мест\n"
                "<b>Особая квота:</b> 9 мест\n"
                "<b>Отдельная квота:</b> 9 мест\n\n"
                "<b>Проходной балл в 2024 году:</b> 238\n\n"

                "<b>Цель программы:</b>\n"
                "Подготовка бакалавров направлена на формирование компетенций специалистов по информационным системам, "
                "способных проводить аналитические исследования и анализ данных с использованием искусственного интеллекта "
                "с акцентом на методы машинного обучения.\n\n"

                "<b>Ключевые компетенции выпускников:</b>\n"
                "🔹 Определение и анализ требований к автоматизации информационных процессов\n"
                "🔹 Проектирование, разработка и внедрение информационных систем и сервисов\n"
                "🔹 Работа с цифровыми программно-аппаратными платформами\n"
                "🔹 Участие в управлении ИТ-проектами\n\n"

                "<b>Уникальность программы:</b>\n"
                "▪️ Подготовка специалистов в области аналитики с применением ИИ и машинного обучения\n"
                "▪️ Получение навыков статистической обработки данных\n"
                "▪️ Моделирование информационных процессов\n"
                "▪️ Изучение элементной базы и архитектуры вычислительных устройств\n\n"

                "<b>Особенности обучения:</b>\n"
                "🔸 Программы дисциплин разработаны с участием практиков ИТ-компаний\n"
                "🔸 Прохождение практики в ИТ-отделах ведущих предприятий\n"
                "🔸 Акцент на практическое применение знаний\n\n"

                "<b>Перспективы выпускников:</b>\n"
                "▫️ Аналитик данных\n"
                "▫️ Специалист по машинному обучению\n"
                "▫️ Разработчик информационных систем\n"
                "▫️ Менеджер ИТ-проектов\n"
                "▫️ Системный архитектор\n\n"

                '<b>Подробнее:</b>\n'
                '<a href="https://priem.guap.ru/bach/calc?filter=dep_4#bach">Приёмная комиссия ГУАП</a>\n'
                '<a href="https://new.guap.ru/i04/k41">Страница кафедры</a>\n'
                "\n"
            )

        elif department == "Направление 09.03.04 — Программная инженерия":
            schedule = (
                "<b>Направление 09.03.04 — Программная инженерия</b>\n\n"

                "<b>Программа:</b> Проектирование программных систем\n"
                "<b>Выпускающая кафедра:</b> компьютерных технологий и программной инженерии\n\n"

                "<b>Форма обучения:</b>\n"
                "🔹 Очная, 4 года\n"
                "🔹 Заочная\n\n"

                "<b>Количество мест:</b>\n"
                "▪️ Бюджет: 80\n"
                "▪️ Контракт: 15\n"
                "▪️ Контракт (иностранные граждане): 5\n"
                "▪️ Целевая квота: 12 мест\n"
                "▪️ Особая квота: 8 мест\n"
                "▪️ Отдельная квота: 8 мест\n\n"

                "<b>Проходной балл в 2024 году:</b> 263\n\n"

                "<b>О программе:</b>\n"
                "Программа направлена на методологию проектирования программных систем различного применения, "
                "включая области ракетно-космической техники.\n\n"

                "<b>Ключевые компетенции:</b>\n"
                "🔹 Анализ и формализация знаний\n"
                "🔹 Системы искусственного интеллекта\n"
                "🔹 Нейронные сети\n"
                "🔹 Технологии «больших данных»\n"
                "🔹 Современные направления программной инженерии\n\n"

                "<b>Уникальные особенности программы:</b>\n"
                "▪️ Ориентация на технологии проектирования ПО\n"
                "▪️ Использование современной методологии программной инженерии\n"
                "▪️ Подготовка к работе в реальном секторе экономики\n"
                "▪️ Быстрая адаптация выпускников на предприятиях\n\n"

                "<b>Перспективные направления:</b>\n"
                "▫️ Разработка ПО для ракетно-космической техники\n"
                "▫️ Проектирование сложных программных систем\n"
                "▫️ Применение ИИ и машинного обучения\n"
                "▫️ Работа с Big Data технологиями\n\n"

                "<b>Практическая подготовка:</b>\n"
                "🔸 Работа с реальными проектами\n"
                "🔸 Современные инструменты разработки\n"
                "🔸 Методологии проектирования\n\n"

                '<b>Подробнее:</b>\n'
                '<a href="https://priem.guap.ru/bach/calc?filter=dep_4#bach">Приёмная комиссия ГУАП</a>\n'
                '<a href="https://new.guap.ru/i04/k43">Страница кафедры</a>\n'
                "\n"
            )

        else:
            schedule = "Не удалось найти."

        await update.message.reply_text(schedule, parse_mode="HTML")